2024-05-29_17-15-59.075149/merged.yml
---
execution:
- concurrency: 5
  hold-for: 5m
  ramp-up: 1m
  scenario: simple_test
reporting:
- dump-csv: report.csv
  dump-json: report.json
  dump-xml: report.xml
  module: final-stats
  percentiles: true
  summary: true
  test-duration: true
scenarios:
  simple_test:
    requests:
    - assertions:
      - contains:
          less-than-equals: 4000
          subject: latency
      headers:
        User-Agent: Mozilla/5.0 (Macintosh; Intel Mac OS X 10_13_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/89.0.4389.90 Safari/537.36
      method: GET
      url: ${BASE_URL}/
    think-time: 2s